#include <stdio.h>

int main() {
    int score = 90.5; //กำหนดค่าตัวแปรชนิด int แต่ใส่ค่าทศนิยม
    printf("a: %f\n", score);

    return 0;
}
// 1) ผลลัพธ์ที่ได้: โปรแกรมแสดงผล Score = 90
// เพราะค่าทศนิยม (.5) จะถูกตัดทิ้งเมื่อแปลงเป็น int เพราะ int ไม่สามารถเก็บค่าทศนิยมได้
//
// 2) ต้องเลือก Data Type ให้ถูกต้อง เพราะถ้าเลือกผิดอาจทำให้ข้อมูลสูญหายหรือโปรแกรมแสดงผลไม่ตรงตามที่ต้องการ ซึ่งมีผลต่อความแม่นยำ
//
// 3) อภิปรายและสรุปผล: ชนิดข้อมูลแบบ int ไม่สามารถเก็บค่าทศนิยมได้ หากกำหนดค่าทศนิยมลงไปจะถูกตัดทศนิยมทิ้ง ส่งผลให้ค่าที่ได้ไม่ตรงตามที่ต้องการ ต้องใช้ชนิดข้อมูลให้ตรงกับลักษณะของข้อมูลจริง
//
//สรุปบทเรียน
//จากการทดลองพบว่า int ไม่สามารถเก็บค่าทศนิยมได้ ทำให้ค่าถูกตัดทิ้ง ส่วน float สามารถเก็บค่าทศนิยมได้อย่างถูกต้อง
//ดังนั้น การเลือกชนิดข้อมูลให้เหมาะสมกับประเภทของ ค่าที่ต้องการใช้งานเป็นสิ่งสำคัญมาก เพราะหากเลือกผิด
//อาจทำให้ค่าคลาดเคลื่อนหรือโปรแกรมทำงานผิดพลาดได้
