#include <stdio.h>

int main() {
    float score = 90.5; //กำหนดค่าทศนิยมให้กับ float 
    printf("a: %f\n", score);

    return 0;
}

// 1) ผลลัพธ์: **คอมไพล์ผ่าน** เพราะ "float" เป็นชนิดข้อมูลที่ถูกต้อง เก็บค่าทศนิยมได้ จึงแสดงผลที่ถูกต้อง
// 2) ต้องเลือก Data Type ให้ถูกต้อง ทั้งชื่อที่ถูกต้อง (เช่น float) และให้ตรงกับชนิดของค่าที่จะเก็บ เพื่อให้โปรแกรมทำงานได้และไม่เกิด error
// 3) อภิปรายและสรุปผล: เมื่อเลือก float กับค่าทศนิยม ผลลัพธ์จะถูกต้องและครบถ้วน หากสะกดชนิดข้อมูลผิดแม้เพียงเล็กน้อย โปรแกรมจะไม่สามารถรันได้เลย ถือเป็นข้อผิดพลาดทาง syntax ที่สำคัญ ต้องระมัดระวังการพิมพ์ให้ถูกต้อง